OpenFOAM-13/test/Lagrangian/coupling/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication decomposePar
runParallel foamRun
runApplication reconstructPar

#------------------------------------------------------------------------------
